/*1.Дано три цілих числа: a, b, c. Перевірте істинність висловлювання:
 a < b < c */
let a = 2;
let b = 4;
let c = 10;
console.log(`2< 4< 10 : ${a < b < c}`);
console.log(`2> 4> 10 : ${a > b > c}`);//test

//2.
let x = 1;
let y = 2;
let res1 = String(4 * (x+y)); // Допишіть код, необхідно використовувати змінні x і y
console.log(res1); // ""12""
console.log(typeof res1); // ""string""


/*3.Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку.
Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення 
про статус особи. Наприклад: при виконанні умови 
вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”,*/
let isAdult = +prompt("Enter your age:");

if (isAdult >= 18) {
    alert("Ви досягли повнолітнього віку");
}
else {
    alert("Ви ще надто молоді");
};




